
<?php
require 'config.php';

$is_user = false;

if (isset($_SESSION["id"])) {
  $is_user = true;
}
?>


<!DOCTYPE html>
<html lang="ar">

<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <link rel="stylesheet" href="css/main.css?>=<?php echo time(); ?> " />
  <title>Info</title>

  <style>
    h1 {
      font-size: 2rem;
      margin-top: 25px;
      color: var(--header-col);
    }

    p {
      color: var(--text-soft);
      width: 80%;
      padding: 10px 0;
      text-align: justify;
    }

    @media screen and (max-width: 640px) {
      h1 {
        font-size: 1.8rem;
      }

      p {
        width: 100%;
        font-size: 1rem;
      }
    }
  </style>
</head>

<body>
  <div class="wrapper">
    <div class="nav">
      <div class="logo">
        <img src="assets/hero.png" alt="logo" />
      </div>
      <ul>
        <li><a href="index.php">Home</a></li>
        <?php
        if (!$is_user) {
          echo "<li><a href='signin.php'>Survey</a></li>";
        } else {
          echo "<li><a href='survey.php'>Survey</a></li>";
        }
        ?>
        <li><a href="info.php">info</a></li>
        <li><a href="about.php">About</a></li>
      </ul>
      <?php
      if (!$is_user) {
        echo "<a href='signin.php' class='signin'>sign in</a>";
      } else {
        echo "<a href='logout.php' class='signin'>logout</a>";
      }
      ?>
    </div>

    <div class="information" dir="rtl">
      <h1>المقدمة</h1>
      <p>التنمر هو مشكلة شائعة تواجهها العديد من الأفراد في مختلف الأعمار والمجتمعات. يمكن تعريف التنمر على أنه سلوك
        عدواني
        يهدف إلى إيذاء الآخرين، سواء عن طريق الكلام أو الأفعال. يعد التنمر ظاهرة خطيرة تؤثر على صحة وسلامة الأفراد
        المتضررين، وتترك لهم آثاراً نفسية واجتماعية سلبية. في هذه المقالة، سنناقش ظاهرة التنمر وأهمية إيجاد حلول فعالة
        لهذه المشكلة القائمة.</p>

      <h1>أهمية توعية الجمهور حول التنمر</h1>

      <p>تعتبر التوعية الجماهيرية حول التنمر أحد الخطوات الأساسية للتصدي لهذه المشكلة. من خلال زيادة الوعي بأضرار التنمر
        وتأثيره السلبي على الأفراد المتضررين، يمكن أن نشجع المجتمعات على تغيير سلوكها ورفض التنمر. يمكن أن تكون التوعية
        عبر حملات إعلامية وتثقيفية في المدارس والجامعات والمجتمعات المحلية. بالإضافة إلى ذلك، يجب تشجيع الأهل والمعلمين
        على تعليم الأطفال والشباب عن قيم الاحترام والتسامح والتعاون، لتحقيق بيئة آمنة وخالية من التنمر.</p>

      <h1> الدور الحكومي في مكافحة التنمر</h1>

      <p>تلعب الحكومات دورًا حاسمًا في مكافحة التنمر وحماية الأفراد المتضررين. يجب على الحكومات وضع سياسات وقوانين صارمة
        تستهدف مكافحة التنمر في المدارس وأماكن العمل والمجتمعات الرقمية. يجب أن توفر السياسات الحكومية آليات للإبلاغ عن
        حالات التنمر ومعاقبة المتنمرين بشكل فوري وعادل. كما يمكن للحكومات تعزيز التعليم والتوعية حول التنمر في المدارس
        وتدريب المعلمين على كيفية التعامل مع حالات التنمر والوقاية منها.</p>

      <h1> أهمية دعم الضحايا وتوفير الدعم النفسي</h1>

      <p>من المهم أن نقدم الدعم اللازم للأفراد الذين يتعرضون للتنمر. يجب على المجتمعات والمدارس والمؤسسات الحكومية توفير
        بيئة داعمة وآمنة للضحايا، حيث يشعرون بالأمان والحماية. يمكن تقديم الدعم النفسي والعاطفي للضحايا من خلال خدمات
        المستشارين والاختصاصيين في الصحة النفسية. بالإضافة إلى ذلك، يجب أن توفر المدارس برامج تدريبية للتعامل مع التنمر
        وتعزيز مهارات التواصل والتعاون بين الطلاب.</p>

      <h1> الخاتمة</h1>

      <p>باعتبار التنمر مشكلة شائعة وخطيرة، يجب علينا جميعًا العمل سويًا لمكافحتها وإيجاد حلول فعالة. من خلال توعية
        الجمهور
        ودعم الضحايا والدور الحكومي الفعّال، يمكننا بناء مجتمعات آمنة وخالية من التنمر. دعونا نعمل جميعًا لتحقيق هذا
        الهدف
        النبيل.</p>
    </div>
  </div>
</body>

</html>